examples/render_all_grammars/dot/tests_functional_test_metamodel_import_repr_second_repr.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40142168[ label="{Second|}"]

40297832[ label="{ID|}"]

40303896[ label="{STRING|}"]

40309432[ label="{BOOL|}"]

40314968[ label="{INT|}"]

40320504[ label="{FLOAT|}"]

40326040[ label="{STRICTFLOAT|}"]

40331576[ label="{NUMBER|}"]

40337112[ label="{BASETYPE|}"]

40342648[ label="{*OBJECT|}"]

40399736[ label="{Third|+a:INT\l}"]



40142168 -> 40399736[arrowtail=diamond, dir=both, headlabel="thirds 1..*"]
40331576 -> 40326040 [dir=back]
40331576 -> 40314968 [dir=back]
40337112 -> 40331576 [dir=back]
40337112 -> 40320504 [dir=back]
40337112 -> 40309432 [dir=back]
40337112 -> 40297832 [dir=back]
40337112 -> 40303896 [dir=back]
40342648 -> 40337112 [dir=back]

}
